# Brewfile

brew "ansible"                          # Automate deployment, configuration, and upgrading
brew "zed"                              # fast simple editor
brew "bat"                              # cat with syntax highlighting
brew "dash"                             # API documentation browser and code snippet manager
brew "delta"                            # Syntax-highlighting pager for git and diff output
brew "direnv"                           # Load/unload environment variables based on $PWD
brew "eza"                              # modern ls replacement
brew "fd"                               # find replacement
brew "fzf"                              # Command-line fuzzy finder
brew "ffmpeg"                           # Record, convert and stream audio and video
brew "gh"                               # GitHub command-line tool
brew "glab"                             # gitlab cli
brew "glow"                             # render markdown on the terminal
brew "gnupg"                            # GNU Privacy Guard (OpenPGP)
brew "graphviz"                         # Graph visualization software from AT&T and Bell Labs
brew "httpie"                           # curl replacement for humans
brew "htop"                             # Improved top (interactive process viewer)
brew "jdtls"                            # Java language specific implementation of the Language Server Protocol
brew "jq"                               # JSON processing
brew "mactop"                           # Hardware monitor with TUI
brew "mas"                              # Mac App Store CLI
brew "mise"                             # Polyglot runtime manager
brew "mkdocs"                           # Project documentation with Markdown
brew "pandoc"                           # Swiss-army knife of markup format conversion
brew "ripgrep"                          # Search tool like grep and The Silver Searcher
brew "starship"                         # Cross-shell prompt for astronauts
brew "stow"                             # Organize software neatly under a single directory tree
brew "tlrc"                             # Official tldr client written in Rust
brew "wget"                             # Internet file retriever
brew "yq"                               # YAML processing
brew "ollama"                           # Create, run, and share large language models (LLMs)
brew "xmlsec1"                          # XML security library
brew "zoxide"                           # smarter cd
brew "zsh-autosuggestions"              # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-syntax-highlighting"          # Fish shell like syntax highlighting for zsh

cask "claude"                           # Anthropic's official Claude AI desktop app
cask "claude-code"                      # Terminal-based AI coding assistant (requires license)
cask "dbvisualizer"                     # Database management and analysis tool
cask "eclipse-installer"                # Install and update your Eclipse Development Environment
cask "gimp"                             # Free and open-source image editor
cask "intellij-idea"                    # Java IDE by JetBrains
cask "mactex"                           # Full TeX Live distribution with GUI applications
cask "obsidian"                         # Knowledge base that works on top of plain text Markdown files
cask "logseq"                           # Great tool to make notes and todo lists
cask "orbstack"                         # Replacement for Docker Desktop; also runs Linux containers
brew "colima"                           # Also a replacement for Docker (no desktop); also runs Linux containers
cask "proxyman"                         # HTTP debugging proxy
cask "viscosity"                        # OpenVPN client with AppleScript support
cask "vlc"                              # Multimedia player
cask "visual-studio-code"               # VS Code editor

cask "font-jetbrains-mono-nerd-font"    # JetBrainsMono Nerd Font families (JetBrains Mono)

# mas "DaisyDisk",            id: 411643860	
# mas "Obsidian Web Clipper", id: 6720708363
# mas "Slack",                id: 803453959
